type temple = {
  label: string;
};

export const temple: temple[] = [
  {
    label:
      "1)스님 - 다양한 설이 있지만 '승(중 僧)님(존칭)'에서 'ㅇ'이 탈락했다는 설이 유력하다.",
  },
  {
    label:
      "9)목탁 - 목어를 휴대하기 편하게 만든 것으로 목탁의 구멍은 물고기의 눈, 손잡이는 꼬리 지느러미와 모양이 비슷하다. 목탁은 물고기와 관련이 깊은데 물고기는 밤낮으로 눈을 감지 않으므로 수행자로 하여금 자지 않고 도를 닦으라는 뜻으로 이것을 두드려 잠을 물리치고 늘 깨어있는 자세로 정진해야 한다는 의미가 있다.",
  },
  {
    label:
      "5)문수보살 - 지혜를 상징하는 보살로 불교에서 지혜는 깨달음을 이루는 선견지명을 뜻한다.",
  },
  { label: "6)보현보살 - 불교의 진리를 수행하고 실천하는 보살이다." },
  {
    label:
      "7)약사여래 - 중생의 질병을 고쳐주는 의료에 관련된 부처로 손에 약병 또는 약항아라를 들고 있다.",
  },
  {
    label:
      "2)보살 - 사람들 속에 살며 지혜와 자비를 얻기 위해 수행하는 사람을 뜻하지만 언제부터 사찰의 여자 신도를 뜻하는 용어로 사용했는지는 분명하지 않다.",
  },
  {
    label:
      "3)코끼리 - 석가모니의 덕을 상징하는 동물로 석가모니의 어머니인 마야부인이 흰 코끼리가 품 안으로 들어오는 태몽을 꾸고 석가모니를 잉태한데서 유래한다.",
  },
  {
    label:
      "4)연꽃 - 늪이나 진흙 속에서 자라나 맑고 깨끗한 꽃을 피워 내듯 걱정과 집착에서 벗어나 깨달음을 얻는 불교의 기본 교리와 비슷해 불교의 상징이 되었다.",
  },
  {
    label:
      "8)도량 - 승려가 수행하는 장소 또는 그곳에서 이루어지는 법회를 뜻한다(예 : 관음기도도량, 수행도량 등)",
  },
];
