type temple = {
  label: string;
};

type sanctum = {
  label: string;
};

type fourProducts = {
  label: string;
};

type portal = {
  label: string;
};

export const temple: temple[] = [
  {
    label:
      "1)스님 - 다양한 설이 있지만 '승(중 僧)님(존칭)'에서 'ㅇ'이 탈락했다는 설이 유력하다.",
  },
  {
    label:
      "2)보살 - 사람들 속에 살며 지혜와 자비를 얻기 위해 수행하는 사람을 뜻하지만 언제부터 사찰의 여자 신도를 뜻하는 용어로 사용했는지는 분명하지 않다.",
  },
  {
    label:
      "3)코끼리 - 석가모니의 덕을 상징하는 동물로 석가모니의 어머니인 마야부인이 흰 코끼리가 품 안으로 들어오는 태몽을 꾸고 석가모니를 잉태한데서 유래한다.",
  },
  {
    label:
      "4)연꽃 - 늪이나 진흙 속에서 자라나 맑고 깨끗한 꽃을 피워 내듯 걱정과 집착에서 벗어나 깨달음을 얻는 불교의 기본 교리와 비슷해 불교의 상징이 되었다.",
  },
  {
    label:
    "5)문수보살 - 지혜를 상징하는 보살로 불교에서 지혜는 깨달음을 이루는 선견지명을 뜻한다.",
  },
  { label: "6)보현보살 - 불교의 진리를 수행하고 실천하는 보살이다." },
  {
    label:
    "7)약사여래 - 중생의 질병을 고쳐주는 의료에 관련된 부처로 손에 약병 또는 약항아라를 들고 있다.",
  },
  {
    label:
      "8)도량 - 승려가 수행하는 장소 또는 그곳에서 이루어지는 법회를 뜻한다(예 : 관음기도도량)",
  },
  {
    label:
      "9)목탁 - 목어를 휴대하기 편하게 만든 것으로 목탁의 구멍은 물고기의 눈, 손잡이는 꼬리 지느러미와 모양이 비슷하다. 목탁은 물고기와 관련이 깊은데 물고기는 밤낮으로 눈을 감지 않으므로 수행자로 하여금 자지 않고 도를 닦으라는 뜻으로 이것을 두드려 잠을 물리치고 늘 깨어있는 자세로 정진해야 한다는 의미가 있다.",
  },
  {
    label:
     "10)상좌부(테라바다) 불교 - 과거에는 '소승불교'라는 이름으로 불렸으나 이는 상좌부(큰 스님을 의미) 불교를 비난하기 위해 후대 붙여진 이름이다. 상좌부 또는 테라바다 불교가 올바를 명칭이다. 상좌부 불교는 고대 인도에서 시작된 초기 불교 학파로 팔리어로 된 경전만을 인정하며 계율과 개인의 해탈을 중시한다. 이를 위해 명상을 중심으로 마음의 고요와 깨달음을 얻는데 집중한다. 개인의 해탈에 집중하기 위해 승려들은 농사 등의 일을 하지 않으며 이런 이유로 사찰음식이라는 개념은 존재하지 않는다. 주로 동남아 지역에 분포한다."
  },
  {
    label:
    "11)대승 불교 - 대승 불교는 승려만의 종교였던 불교를 널리 민중에게까지 보급하기 위해 출가하지 않고 수행하는 신도를 포함하고자 하여 시작되었으며 산스크리트 경전도 인정한다. 대승 불교는 석가모니의 가르침을 널리 보급하고 중생을 구제하는 것을 목표로 하며 이를 위해 명상뿐만 아니라 경전 독송, 베품 등 공덕을 쌓는 것을 중시한다. 동북아시아 지역에 주로 분포한다."
  }
];

export const sanctum: sanctum[] = [
  {
    label:
      "1)대웅전(大雄殿) - 석가모니를 위대한 영웅, 즉 대웅이라 일컬은 데서 유래하며 석가모니를 모신다.",
  },
  {
    label:
      "2)극락전(極樂殿) - '극락'이란 기독교의 '천국'과 비슷하지만 신이 아닌 스스로 깨달음을 통해서만 도달할 수 있는 곳이다. 쉽게 깨달음을 얻어 극락에 도달할 수 있도록 가르침을 전하는 '아미타불'을 모신다. '극락보전(極樂寶殿)', '무량수전(無量壽殿)'으로도 불린다.",
  },
  {
    label:
      "3)명부전(冥府殿) - '명부'란 저승세계를 말하며 염라대왕을 비롯한 총 10명의 지옥왕과 지옥에 빠진 모든 생명을 보살펴 자비로써 감싸 주는 '지장보살'을 모시는 전각으로 '시왕전(十王殿)'이라고도 한다.",
  },
  {
    label:
      "4)칠성각(七星閣) - 무속신앙에서 인간의 생로병사를 주관하는 '칠성신'을 모신다.",
  },
  {
    label: "5)산신각(山神閣) - 도교의 토착신인 '산신'을 모신다.",
  },
  {
    label:
      "6)독성각(三聖閣) - 불가의 어른인 나반존자(홀로 깨달아 성인이 된 사람)를 뜻하는 독성신을 모시며 산신, 칠성, 독성 모두를 모시면 삼성각(三聖閣)으로 부른다.",
  },
  {
    label:
      "7)적멸보궁(寂滅寶宮) - 석가모니의 진신사리를 봉안하는 법당으로 불상을 모시지  않는다.",
  },
  {
    label:
      "8)대적광전(大寂光殿) - 어디에나 존재하는 빛처럼 때와 장소를 가리지 않고 다양한 모습으로 나타나는, 불교의 세계관을 인격화한 '비로자나불'을 모신다.",
  },
  {
    label:
      "9)미륵전(彌勒殿) - 미륵불을 모시는 법당으로 '미륵'은 미래에 나타날 구원자를 뜻한다(≒ 기독교 '메시아’)",
  },
  {
    label:
      "10)약사전(藥師殿) - 병을 치료하고 가난과 배고픔으로부터 모든 생명을 보살펴 구제하는 '약사여래'를 모시며 손에 약병이나 약항아리를 들고 있다.",
  },
  {
    label:
      "11)관음전(觀音殿) - 사람들이 부르는 소리를 듣고 그에 응하여 원하는 바를 들어주는 '관세음보살'을 모시며 '원통보전(圓通寶殿)'으로도 불린다.",
  },
  {
    label:
      "12)조사당/전(祖師堂/殿) - 해당 사찰 출신으로 덕이 높은 승려들을 모신 법당이다.",
  },
  {
    label:
      "13)영산전(靈山殿) - 대웅전과 비슷하지만 석가모니가 대중에서 설법하는 장면을 묘사한 법당으로 석가모니 주변에 많은 불상이 있다. 팔상전(八相殿)으로도 불린다.",
  },
];

export const fourProducts: fourProducts[] = [
  {
    label:
      "1)범종(梵鐘) - 인간의 걱정과 집착을 끊고 깨달음을 얻도록 이끌어주기 위해 친다.",
  },
  {
    label:
      "2)법고(法鼓) - 불법을 전하는 북이라는 뜻으로 육상생물을 교화하기 위해 치며 법당에서 사용하는 법고는 소고, 종각에 두고 치는 법고는 홍고(弘鼓) 또는 대고(大鼓)라고 한다. 법전사물 중 유일하게 춤사위를 곁들이기도 한다.",
  },
  {
    label: "3)목어(木魚) - 나무로 만든 물고기로 수상생물을 교화하기 위해 친다.",
  },
  {
    label:
      "4)운판(雲版) - 구름 모양의 철판 또는 청동판으로 하늘의 생명을 교화하기 위해 친다.",
  },
  {
    label:
      "범종각(梵鐘閣) - 범종을 달아 놓은 전각으로 단층일 경우 '각(閣)', 2층일 경우 ' 루(樓)'라고 한다. 규모가 작은 사찰은 범종만 달아놓으며 규모가 큰 사찰은 범종 뿐만 아니라 법고, 목어, 운판을 함께 달아 놓는다. 범종(梵鐘), 법고(法鼓), 목어(木魚), 운판(雲版) 네 가지를 법전사물(法殿四物)이라 부르며 사물(四物)은 새벽과 저녁 그리고 사시(오전 9시~11시)에 친다.",
  },
];

export const portal: portal[] = [
  {
    label:
      "1)일주문(一柱門) - 사찰 정문으로 대체로 사찰 이름을 건다. 일주문은 하나의 마음으로 정진하겠다는 의지를 다지는 문을 뜻한다.",
  },
  {
    label:
      "2)금강문(金剛門) - 금강문이 있는 경우 일주문과 천왕문 사이에 있다. 금강문은 금강(다이아몬드)과 같은 마음으로 갈등과 집착으로 인한 괴로움을 극복하려는 마음을 다지는 문을 뜻한다.",
  },
  {
    label:
      "3)천왕문(天王門) - 일주문 또는 금강문 다음 문으로 동서남북 사방을 지키는 사천왕상이 있다. 천왕문은 사찰에 악귀가 스며들지 못하게 하는 역할을 한다.",
  },
  {
    label:
      "4)불이문(不二門) - 사찰 본당으로 들어가는 마지막 문으로 '불이법문(不二法門)'의 준말이다. 불이문은 서로 상대되는 두 가지가 실은 둘이 아니라는 가르침으로 선과 악, 생과 사, 참과 거짓 등은 서로 다른 것으로 보이지만 실은 하나에서 시작됨을 뜻한다.",
  },
];
